cF-embedded/stm32f1_reactiontime/src/hw/ili9325/ili9325_registers.h
/**
 * @file ili9325.c
 * @author cF-embedded (cf@embedded.pl)
 * @brief ili9325 hw configuration
 *
 * @copyright Copyright (c) 2024
 *
 */

#ifndef ILI9325_REGISTERS_H
#define ILI9325_REGISTERS_H

#define ILI9325_DRIVER_CODE_REG                   0x00
#define ILI9325_DRIVER_OUTPUT_CONTROL_1           0x01
#define ILI9325_LCD_DRIVING_WAVE_CONTROL          0x02
#define ILI9325_ENTRY_MODE                        0x03
#define ILI9325_RESIZING_CONTROL_REGISTER         0x04
#define ILI9325_DISPLAY_CONTROL_1                 0x07
#define ILI9325_DISPLAY_CONTROL_2                 0x08
#define ILI9325_DISPLAY_CONTROL_3                 0x09
#define ILI9325_DISPLAY_CONTROL_4                 0x0A
#define ILI9325_RGB_DISPLAY_INTERFACE_CONTROL_1   0x0C
#define ILI9325_FRAME_MAKER_POSITION              0x0D
#define ILI9325_RGB_DISPLAY_INTERFACE_CONTROL_2   0x0F
#define ILI9325_POWER_CONTROL_1                   0x10
#define ILI9325_POWER_CONTROL_2                   0x11
#define ILI9325_POWER_CONTROL_3                   0x12
#define ILI9325_POWER_CONTROL_4                   0x13
#define ILI9325_HORIZONTAL_GRAM_ADDRESS_SET       0x20
#define ILI9325_VERTICAL_GRAM_ADDRESS_SET         0x21
#define ILI9325_WRITE_DATA_TO_GRAM                0x22
#define ILI9325_POWER_CONTROL_7                   0x29
#define ILI9325_FRAME_RATE_AND_COLOR_CONTROL      0x2B
#define ILI9325_GAMMA_CONTROL_1                   0x30
#define ILI9325_GAMMA_CONTROL_2                   0x31
#define ILI9325_GAMMA_CONTROL_3                   0x32
#define ILI9325_GAMMA_CONTROL_4                   0x35
#define ILI9325_GAMMA_CONTROL_5                   0x36
#define ILI9325_GAMMA_CONTROL_6                   0x37
#define ILI9325_GAMMA_CONTROL_7                   0x38
#define ILI9325_GAMMA_CONTROL_8                   0x39
#define ILI9325_GAMMA_CONTROL_9                   0x3C
#define ILI9325_GAMMA_CONTROL_10                  0x3D
#define ILI9325_HORIZONTAL_ADDRESS_START_POSITION 0x50
#define ILI9325_HORIZONTAL_ADDRESS_END_POSITION   0x51
#define ILI9325_VERTICAL_ADDRESS_START_POSITION   0x52
#define ILI9325_VERTICAL_ADDRESS_END_POSITION     0x53
#define ILI9325_DRIVER_OUTPUT_CONTROL_2           0x60
#define ILI9325_BASE_IMAGE_DISPLAY_CONTROL        0x61
#define ILI9325_VERTICAL_SCROLL_CONTROL           0x6A
#define ILI9325_PARTIAL_IMAGE_1_DISPLAY_POSITION  0x80
#define ILI9325_PARTIAL_IMAGE_1_AREA_START_LINE   0x81
#define ILI9325_PARTIAL_IMAGE_1_AREA_END_LINE     0x82
#define ILI9325_PARTIAL_IMAGE_2_DISPLAY_POSITION  0x83
#define ILI9325_PARTIAL_IMAGE_2_AREA_START_LINE   0x84
#define ILI9325_PARTIAL_IMAGE_2_AREA_END_LINE     0x85
#define ILI9325_PANEL_INTERFACE_CONTROL_1         0x90
#define ILI9325_PANEL_INTERFACE_CONTROL_2         0x92
#define ILI9325_PANEL_INTERFACE_CONTROL_3         0x93
#define ILI9325_PANEL_INTERFACE_CONTROL_4         0x95
#define ILI9325_PANEL_INTERFACE_CONTROL_5         0x97
#define ILI9325_PANEL_INTERFACE_CONTROL_6         0x98
#define ILI9325_INTERNAL_TIMING_1                 0xE3
#define ILI9325_INTERNAL_TIMING_2                 0xE7
#define ILI9325_INTERNAL_TIMING_3                 0xEF

#endif   // ILI9325_REGISTERS_H